'''Сколько единиц в двоичной записи числа 8**1341 - 4 ** 1342 + 2 ** 1343 - 1344?'''
print(bin(8**1341 - 4 ** 1342 + 2 ** 1343 - 1344).count('1'))